# EndSetBack Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptProfile..::..EndSetBack Property
SweptProfile Class See Also
---
The distance from the end of the driving curve to the point where the sweep actually ends.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double EndSetBack { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndSetBack As Double
	Get
```

Visual C++
---
```text
public:
property double EndSetBack {
	double get ();
}
```

# See Also
SweptProfile Class
Autodesk.Revit.DB Namespace